Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The Event Statistics Service is an event-driven microservice exposing a https://en.wikipedia.org/wiki/WebSocket[WebSocket^] HTTP layer. It listens for fight events in https://avro.apache.org/docs/current[Apache Avro^] format on a Kafka topic utilizing https://quarkus.io/guides/kafka[SmallRye Reactive Messaging^]. The fight schema is automatically registered in an https://www.apicur.io/registry[Apicurio Schema Registry^] by the https://quarkus.io/guides/kafka-schema-registry-avro[Quarkus Apicurio Avro extension^].
ja_jp: Event Statistics サービスは、 link:https://en.wikipedia.org/wiki/WebSocket[WebSocket, window=_blank]HTTPレイヤーを公開するイベント駆動型のマイクロサービスです。 link:https://quarkus.io/guides/kafka[SmallRye Reactive Messaging, window=_blank]を利用したKafkaトピック上で、 link:https://avro.apache.org/docs/current[Apache Avro, window=_blank]フォーマットの試合イベントをリッスンします。戦いのスキーマは、 link:https://quarkus.io/guides/kafka-schema-registry-avro[Quarkus Apicurio Avro extension, window=_blank]によって link:https://www.apicur.io/registry[Apicurio Schema Registry, window=_blank]に自動的に登録されます。

source: The Event Statistics service contains a full suite of unit and integration tests using https://quarkus.io/guides/getting-started-testing#further-simplification-with-injectmock[mocking^] and https://quarkus.io/guides/getting-started-testing#using-spies-instead-of-mocks-with-injectspy[spying^]. It also shows how to https://quarkus.io/guides/getting-started-testing#testing-dev-services[inject Dev Services information^] to configure test resources, such as a `+KafkaProducer+`.
ja_jp: Event Statistics サービスには、 link:https://quarkus.io/guides/getting-started-testing#further-simplification-with-injectmock[モッキング, window=_blank]と link:https://quarkus.io/guides/getting-started-testing#using-spies-instead-of-mocks-with-injectspy[スパイ, window=_blank]を使用したユニット・テストと統合テストの完全なスイートが含まれています。また、 link:https://quarkus.io/guides/getting-started-testing#testing-dev-services[Dev Services の情報を注入し, window=_blank]て、 `KafkaProducer` のようなテスト・リソースを構成する方法も紹介しています。

source: The Evolution of the Platform Model
ja_jp: プラットフォームモデルの進化

source: The Extension registry is still a work in progress (https://registry.quarkus.io), but the gist of it is to have a single place to browse for extensions (including https://code.quarkus.io, command line and IDE plugins).
ja_jp: Extension レジストリーはまだ作業中ですが( https://registry.quarkus.io )、その要旨は、エクステンション ( https://code.quarkus.io 、コマンドライン、IDE プラグインを含む) を単一の場所で閲覧できるようにすることです。

source: The FQCN of the declaring class is used as a logger name, for example, `org.jboss.logging.Logger.getLogger(SimpleBean.class)` will be used.
ja_jp: 宣言クラスのFQCNがロガー名として使用されます。例えば、 `org.jboss.logging.Logger.getLogger(SimpleBean.class)` が使用されます。

source: The FQCN of the declaring class is used as a logger name, i.e. `org.jboss.logging.Logger.getLogger(SimpleBean.class)` will be used.
ja_jp: `org.jboss.logging.Logger.getLogger(SimpleBean.class)` 宣言したクラスのFQCNがロガー名として使用されます。

source: The Fabric8 Kubernetes Client uses its own `ObjectMapper` instance for serialization and deserialization of Kubernetes resources. This mapper is provided to the client through a `KubernetesSerialization` instance that's injected into the `KubernetesClient` bean.
ja_jp: Fabric8 Kubernetes Clientは、Kubernetesリソースのシリアライズとデシリアライズのために独自の `ObjectMapper` インスタンスを使用します。このマッパーは、 `KubernetesClient` Beanに注入された `KubernetesSerialization` インスタンスを通してクライアントに提供されます。

source: The February Newsletter has been published! This month, you can find an introduction to the new Quarkus Superheroes sample application as well as articles teaching you how to get started with Stork Service Discovery, Java Asynchronous Programming with Java, Distributed tracing with Istio, Quarkus and Jaeger, Monitoring Quarkus Prometheus and Grafana, and how to create a Quarkus extension for AWS Cloudwatch. Of course it includes selected Quarkus Insights podcast videos, top tweets, and the latest community events around Quarkus.
ja_jp: 2月号ニュースレターが発行されました。今月は、新しいQuarkus Superheroesサンプルアプリケーションの紹介や、Stork Service Discoveryの始め方、Javaによる非同期プログラミング、Istioによる分散トレース、QuarkusとJaeger、Quarkus PrometheusとGrafanaのモニタリング、AWS Cloudwatch用のQuarkusエクステンションの作成方法などを教える記事が掲載されています。もちろん、厳選されたQuarkus Insightsポッドキャストビデオ、トップツイート、Quarkusに関する最新のコミュニティイベントも収録されています。

source: The Fight service contains a full suite of unit and integration tests, using https://quarkus.io/guides/getting-started-testing#further-simplification-with-injectmock[mocking^], https://quarkus.io/guides/getting-started-testing#using-spies-instead-of-mocks-with-injectspy[spying^], and testing within https://quarkus.io/guides/hibernate-reactive-panache#transactions[isolated transactions^]. It also makes heavy use of https://wiremock.org/[Wiremock^] for mocking downstream REST endpoints, an https://quarkus.io/guides/kafka#testing-without-a-broker[in-memory Kafka connector^] for performing message verification within unit tests. It also shows how to https://quarkus.io/guides/getting-started-testing#testing-dev-services[inject Dev Services information^] to configure test resources, such as a `+KafkaConsumer+`.
ja_jp: Fightサービスには、ユニットテストとインテグレーションテストの完全なスイートが含まれており、 link:https://quarkus.io/guides/getting-started-testing#further-simplification-with-injectmock[モッキング, window=_blank]、 link:https://quarkus.io/guides/getting-started-testing#using-spies-instead-of-mocks-with-injectspy[スパイ, window=_blank]、 link:https://quarkus.io/guides/hibernate-reactive-panache#transactions[隔離された, window=_blank]トランザクション内でのテストを使用しています。また、下流のRESTエンドポイントをモックするための link:https://wiremock.org/[Wiremock, window=_blank]や、ユニット・テスト内でメッセージの検証を行うための link:https://quarkus.io/guides/kafka#testing-without-a-broker[インメモリKafkaコネクタ, window=_blank]を多用しています。また、 link:https://quarkus.io/guides/getting-started-testing#testing-dev-services[Dev Servicesの情報を注入し, window=_blank]て、 `KafkaConsumer`.NETなどのテスト・リソースを設定する方法も紹介しています。

source: The Fight service is a fully reactive and non-blocking HTTP microservice exposing a RESTful API for performing fights between heroes and villains. The REST layer is implemented using https://quarkus.io/guides/resteasy-reactive[RESTEasy Reactive^] with reactive endpoints. Fight data is persisted into a MongoDB database using the https://quarkus.io/guides/mongodb-panache#solution-1-using-the-active-record-pattern[active record pattern^] from https://quarkus.io/guides/mongodb-panache#reactive[Quarkus MongoDB Reactive with Panache^]. The Fight service also favors https://quarkus.io/guides/cdi-reference#simplified-constructor-injection[constructor injection^] of beans over https://quarkus.io/guides/cdi-reference#qualified-injected-fields[field injection^].
ja_jp: Fightサービスは、完全にリアクティブでノンブロッキングなHTTPマイクロサービスで、ヒーローとヴィランの間で戦いを実行するためのRESTful APIを公開しています。REST層は link:https://quarkus.io/guides/resteasy-reactive[RESTEasy Reactive, window=_blank]を使用して実装されており、リアクティブなエンドポイントを備えています。戦いのデータは、 link:https://quarkus.io/guides/hibernate-reactive-panache[Quarkus Hibernate Reactive with Panache, window=_blank]の link:https://quarkus.io/guides/hibernate-reactive-panache#solution-1-using-the-active-record-pattern[active recordパターン, window=_blank]を使用してPostgreSQLデータベースに永続化されます。また、Fightサービスでは、 link:https://quarkus.io/guides/cdi-reference#qualified-injected-fields[フィールド・インジェクション, window=_blank]よりも link:https://quarkus.io/guides/cdi-reference#simplified-constructor-injection[コンストラクタ・インジェクション, window=_blank]を採用しています。

source: The Fight service makes outgoing REST calls to both the Hero and Villain services. Calls to the Hero service use the https://quarkus.io/guides/rest-client-reactive[reactive rest client^] while calls to the Villain service use the https://quarkus.io/guides/resteasy-reactive#resteasy-reactive-client[RESTEasy Reactive client^], a https://download.eclipse.org/microprofile/microprofile-rest-client-3.0/microprofile-rest-client-spec-3.0.html[MicroProfile Rest Client^] implementation of the https://docs.oracle.com/javaee/7/tutorial/jaxrs-client001.htm[JAX-RS client API^] that is non-blocking at its core. All outgoing calls use https://quarkus.io/guides/smallrye-fault-tolerance[resilience patterns^] such as https://quarkus.io/guides/smallrye-fault-tolerance#adding-resiliency-retries[retry^], https://quarkus.io/guides/smallrye-fault-tolerance#adding-resiliency-timeouts[timeout^], https://quarkus.io/guides/smallrye-fault-tolerance#adding-resiliency-fallbacks[fallback^], and https://quarkus.io/guides/smallrye-fault-tolerance#adding-resiliency-circuit-breaker[circuit breaking^].
ja_jp: Fightサービスは、HeroサービスとVillainサービスの両方にREST呼び出しを行います。Heroサービスへの呼び出しは link:https://quarkus.io/guides/rest-client-reactive[reactive rest client, window=_blank]を使用し、Villainサービスへの呼び出しは link:https://quarkus.io/guides/resteasy-reactive#resteasy-reactive-client[RESTEasy Reactive, window=_blank] clientを使用します。RESTEasy link:https://quarkus.io/guides/resteasy-reactive#resteasy-reactive-client[Reactive, window=_blank] clientは、 link:https://docs.oracle.com/javaee/7/tutorial/jaxrs-client001.htm[JAX-RSクライアントAPI, window=_blank]の link:https://download.eclipse.org/microprofile/microprofile-rest-client-3.0/microprofile-rest-client-spec-3.0.html[MicroProfile Rest Client, window=_blank]実装であり、そのコアはノンブロッキングです。すべての発信コールは、 link:https://quarkus.io/guides/smallrye-fault-tolerance#adding-resiliency-retries[リトライ, window=_blank]、 link:https://quarkus.io/guides/smallrye-fault-tolerance#adding-resiliency-timeouts[タイムアウト, window=_blank]、 link:https://quarkus.io/guides/smallrye-fault-tolerance#adding-resiliency-fallbacks[フォールバック, window=_blank]、 link:https://quarkus.io/guides/smallrye-fault-tolerance#adding-resiliency-circuit-breaker[サーキットブレーキング, window=_blank]などの link:https://quarkus.io/guides/smallrye-fault-tolerance[レジリエンスパターン, window=_blank]を使用しています。

source: The Flyway extension supports custom credentials/URLs to connect to the database and you can more easily customize the configuration of the Flyway instance.
ja_jp: Flywayエクステンションは、データベースに接続するためのカスタムクレデンシャル/URLをサポートしており、Flywayインスタンスの設定をより簡単にカスタマイズすることができます。

source: The Funqy API is simple. Annotate a method with `@Funq`. This method may only have one optional input parameter and may or may not return a response.
ja_jp: Funqy API はシンプルです。メソッドに `@Funq` をアノテーションします。このメソッドはオプションの入力パラメータを1つだけ持つことができ、レスポンスを返すこともあれば返さないこともあります。

source: The Funqy API will usually not allow you to inject or use abstractions that are specific to a protocol (i.e. HTTP) or function API (i.e. AWS Lambda). There are exceptions to the rule though and you may be able to inject contextual information that is specific to the environment you are deploying in.
ja_jp: Funqy APIは通常、プロトコル(例:HTTP)や関数API(例:AWS Lambda)に固有の抽象化を注入したり使用したりすることはできません。しかし、ルールには例外があり、デプロイしている環境に固有のコンテキスト情報を注入できるかもしれません。

source: The Funqy API will usually not allow you to inject or use abstractions that are specific to a protocol (i.e. HTTP) or function API (i.e. AWS Lambda). There are exceptions to the rule though, and you may be able to inject contextual information that is specific to the environment you are deploying in.
ja_jp: 通常、 Funqy API はプロトコル (例: HTTP ) やファンクション API (例: AWS Lambda) に固有の抽象化を注入したり、使用したりすることはできません。例外もあり、デプロイ先の環境に応じたコンテキスト情報を注入できる場合もあります。

source: The Funqy HTTP + AWS Lambda binding is not a replacement for REST over HTTP. Because Funqy needs to be portable across a lot of different protocols and function providers its HTTP binding is very minimalistic and you will lose REST features like linking and the ability to leverage HTTP features like cache-control and conditional GETs. You may want to consider using Quarkus's JAX-RS, Spring MVC, or Vert.x Web Reactive Route xref:amazon-lambda-http.adoc[support] instead. They also work with Quarkus and AWS Lambda.
ja_jp: FunqyのHTTP + AWS Lambdaバインディングは、HTTP上のRESTの代替ではありません。Funqyは多くの異なるプロトコルや関数プロバイダ間でポータブルである必要があるため、そのHTTPバインディングは非常にミニマルであり、リンクのようなREST機能や、キャッシュコントロールや条件付きGETのようなHTTP機能を活用する能力は失われます。代わりに、QuarkusのJAX-RS、Spring MVC、またはVert.x Web Reactive Routeの link:amazon-lambda-http.html[サポート] を使用することを検討するとよいでしょう。これらは、QuarkusとAWS Lambdaでも動作します。

source: The Funqy HTTP + AWS Lambda binding is not a replacement for REST over HTTP. Because Funqy needs to be portable across a lot of different protocols and function providers its HTTP binding is very minimalistic and you will lose REST features like linking and the ability to leverage HTTP features like cache-control and conditional GETs. You may want to consider using Quarkus's Jakarta REST, Spring MVC, or Vert.x Web Reactive Route xref:amazon-lambda-http.adoc[support] instead. They also work with Quarkus and AWS Lambda.
ja_jp: Funqy HTTP + AWS Lambdaバインディングは、REST over HTTPの代替ではありません。Funqyは多くの異なるプロトコルや機能プロバイダ間でポータブルである必要があるため、そのHTTPバインディングは非常にミニマルであり、リンクなどのREST機能、キャッシュコントロールや条件付きGETなどのHTTP機能を活用する機能は失われます。代わりに、QuarkusのJakarta REST、Spring MVC、またはVert.x Web Reactive Routeの xref:amazon-lambda-http.adoc[サポート] を使用することを検討するとよいでしょう。これらは、QuarkusとAWS Lambdaでも使用できます。

source: The Funqy HTTP + AWS Lambda binding is not a replacement for REST over HTTP. Because Funqy needs to be portable across a lot of different protocols and function providers its HTTP binding is very minimalistic and you will lose REST features like linking and the ability to leverage HTTP features like cache-control and conditional GETs. You may want to consider using Quarkus's Jakarta REST, Spring MVC, or Vert.x Web Reactive Route xref:aws-lambda-http.adoc[support] instead. They also work with Quarkus and AWS Lambda.
ja_jp: Funqy HTTP + AWS Lambda バインディングは REST over HTTP の代替ではありません。 Funqyは多くの異なるプロトコルや関数プロバイダ間でポータブルである必要があるため、そのHTTPバインディングは非常にミニマルであり、リンクのようなRESTの機能や、キャッシュ制御や条件付きGETのようなHTTPの機能を活用する機能は失われます。 代わりに、QuarkusのJakarta REST、Spring MVC、またはVert.x Web Reactive Routeの xref:aws-lambda-http.adoc[サポート] を使用することを検討するとよいでしょう。これらは、QuarkusとAWS Lambdaでも動作します。

source: The Funqy HTTP + Azure Functions binding is not a replacement for REST over HTTP. Because Funqy needs to be portable cross a lot of different protocols and function providers its HTTP binding is very minimalistic and you will lose REST features like linking and the ability to leverage HTTP features like cache-control and conditional GETs. You may want to consider using Quarkus's JAX-RS, Spring MVC, or Vert.x Web Reactive Route xref:azure-functions-http.adoc[support] instead. They also work with Quarkus and Azure Functions.
ja_jp: FunqyのHTTP + Azure Functionsバインディングは、HTTP上のRESTの代替ではありません。Funqyは多くの異なるプロトコルや関数プロバイダに移植する必要があるため、そのHTTPバインディングは非常にミニマムであり、リンクのようなREST機能や、キャッシュコントロールや条件付きGETのようなHTTP機能を活用する能力は失われます。代わりに、QuarkusのJAX-RS、Spring MVC、またはVert.x Web Reactive Route の link:azure-functions-http.html[サポート]を使用することを検討するとよいでしょう。これらは、QuarkusとAzure Functionsでも動作します。

source: The Funqy HTTP + Azure Functions binding is not a replacement for REST over HTTP. Because Funqy needs to be portable cross a lot of different protocols and function providers its HTTP binding is very minimalistic and you will lose REST features like linking and the ability to leverage HTTP features like cache-control and conditional GETs. You may want to consider using Quarkus's Jakarta REST, Spring MVC, or Vert.x Web Reactive Route xref:azure-functions-http.adoc[support] instead. They also work with Quarkus and Azure Functions.
ja_jp: Funqy HTTP + Azure Functionsバインディングは、REST over HTTPの代替ではありません。Funqyは多くの異なるプロトコルや関数プロバイダー間でポータブルである必要があるため、HTTPバインディングは非常にミニマルであり、リンクなどのREST機能、キャッシュ制御や条件付きGETなどのHTTP機能を利用する機能は失われます。QuarkusのJakarta REST、Spring MVC、Vert.x Web Reactive Routeの xref:azure-functions-http.adoc[サポート] を代わりに使用することを検討するとよいでしょう。これらは、QuarkusとAzure Functionsでも使用できます。

source: The Funqy HTTP + Google Cloud Functions binding is not a replacement for REST over HTTP. Because Funqy needs to be portable across a lot of different protocols and function providers its HTTP binding is very minimalistic and you will lose REST features like linking and the ability to leverage HTTP features like cache-control and conditional GETs. You may want to consider using Quarkus's JAX-RS, Spring MVC, or Vert.x Web Reactive Route xref:gcp-functions-http.adoc[support] instead. They also work with Quarkus and Google Cloud Functions.
ja_jp: Funqy HTTP + Google Cloud Functions バインディングは、HTTP上のRESTを置き換えるものではありません。Funqyは多くの異なるプロトコルや関数プロバイダ間でポータブルである必要があるため、そのHTTPバインディングは非常にミニマルであり、リンクのようなREST機能や、キャッシュコントロールや条件付きGETのようなHTTP機能を活用する能力は失われます。代わりに、QuarkusのJAX-RS、Spring MVC、またはVert.x Web Reactive Routeの link:gcp-functions-http.html[サポート] 使用することを検討するとよいでしょう。これらは、QuarkusとGoogle Cloud Functionsでも動作します。

source: The Funqy HTTP + Google Cloud Functions binding is not a replacement for REST over HTTP. Because Funqy needs to be portable across a lot of different protocols and function providers its HTTP binding is very minimalistic and you will lose REST features like linking and the ability to leverage HTTP features like cache-control and conditional GETs. You may want to consider using Quarkus's Jakarta REST, Spring MVC, or Vert.x Web Reactive Route xref:gcp-functions-http.adoc[support] instead. They also work with Quarkus and Google Cloud Functions.
ja_jp: Funqy HTTP + Google Cloud Functionsのバインディングは、REST over HTTPの代替にはなりません。Funqyは多くの異なるプロトコルや関数プロバイダ間でポータブルである必要があるため、HTTPバインディングは非常にミニマムで、リンクなどのREST機能、キャッシュコントロールや条件付きGETなどのHTTP機能を利用する機能は失われます。代わりに、QuarkusのJakarta REST、Spring MVC、またはVert.x Web Reactive Routeの xref:gcp-functions-http.adoc[サポート] を使用することを検討するとよいでしょう。これらは、QuarkusとGoogle Cloud Functionsでも使用できます。

source: The Funqy HTTP binding is not a replacement for REST over HTTP. Because Funqy needs to be portable across a lot of different protocols and function providers its HTTP binding is very minimalistic and you will lose REST features like linking and the ability to leverage HTTP features like cache-control and conditional GETs. You may want to consider using Quarkus's JAX-RS, Spring MVC, or Vert.x Web Reactive Routes support instead, although Funqy will have less overhead than these alternatives (except Vert.x which is still super fast).
ja_jp: FunqyのHTTPバインディングはHTTP上のRESTの代わりではありません。Funqyは多くの異なるプロトコルや Function プロバイダに対してポータブルである必要があるので、HTTPバインディングは非常にミニマムで、リンクのようなREST機能やキャッシュコントロールや条件付きGETのようなHTTPを利用する機能を失うことになります。代わりにQuarkusのJAX-RS、Spring MVC、またはVert.x Web Reactive Routesのサポートを使用することを検討すると良いでしょう。しかしながら、Funqy はこれらの選択肢と比べてオーバーヘッドが小さいでしょう(例外として Vert.x はそれでもすごく早いですが)。

source: The Funqy HTTP binding is not a replacement for REST over HTTP. Because Funqy needs to be portable across a lot of different protocols and function providers its HTTP binding is very minimalistic and you will lose REST features like linking and the ability to leverage HTTP features like cache-control and conditional GETs. You may want to consider using Quarkus's Jakarta REST, Spring MVC, or Vert.x Web Reactive Routes support instead, although Funqy will have less overhead than these alternatives (except Vert.x which is still super fast).
ja_jp: FunqyのHTTPバインディングはHTTP上のRESTの代わりではありません。Funqyは多くの異なるプロトコルや Function プロバイダに対してポータブルである必要があるので、HTTPバインディングは非常にミニマムで、リンクのようなREST機能やキャッシュコントロールや条件付きGETのようなHTTPを利用する機能を失うことになります。代わりにQuarkusのJakarta REST、Spring MVC、またはVert.x Web Reactive Routesのサポートを使用することを検討すると良いでしょう。しかしながら、Funqy はこれらの選択肢と比べてオーバーヘッドが小さいでしょう(例外として Vert.x はそれでもすごく早いですが)。

source: The Funqy HTTP endpoint
ja_jp: Funqy HTTP エンドポイント

source: The Funqy Knative Events extension also has annotations to do this Cloud Event mapping to your functions. Take a look at the `annotatedChain` method
ja_jp: Funqy Knative Events エクステンションには、この Cloud Event の関数へのマッピングを行うためのアノテーションも用意されています。 `annotatedChain` メソッドを見てみましょう。

source: The Google Cloud Function framework has been updated to 2.0.
ja_jp: Google Cloud Function フレームワークが 2.0 に更新されました。

source: The Graal SDK supports substitutions of classes in the native image. An example of how one could replace the `XmlConfig/XmlData` classes with versions that have no JAXB annotation dependencies is shown in these example classes:
ja_jp: Graal SDK は、ネイティブイメージ内のクラスの置換をサポートしています。 `XmlConfig/XmlData` のクラスを、JAXB アノテーションに依存しないバージョンのクラスに置き換える方法の例を以下に示します。

source: The Gradle extension plugin is still experimental and may be missing features available in the Maven plugin.
ja_jp: Gradleエクステンションプラグインはまだ実験的なもので、Mavenプラグインで利用できる機能が欠けている可能性があります。

source: The Gradle extension plugin is still experimental and may change in the future.
ja_jp: Gradleエクステンションプラグインはまだ実験的なものであり、将来的に変更される可能性があります。

source: The GraphQL API can be expanded without breaking previous queries enabling easy API `evolution`.
ja_jp: GraphQL APIは、以前のクエリを壊すことなく拡張することができ、API `evolution` を容易にすることができます。

source: The GraphQL UI can be accessed from http://localhost:8080/q/graphql-ui/ .
ja_jp: GraphQLは、 http://localhost:8080/q/graphql-ui/ からアクセスできます。

source: The GraphQL endpoints used to have the `@Dependent` CDI scope by default, which was suboptimal. They are now `@Singleton` by default.
ja_jp: GraphQL エンドポイントは、デフォルトで `@Dependent` CDI スコープを持っていましたが、これは最適ではありませんでした。現在は、デフォルトで `@Singleton` になっています。

source: The GraphQL extensions now support non-blocking workloads.
ja_jp: GraphQL エクステンションがノンブロッキングワークロードをサポートするようになりました。

source: The GreetingsResource with OpenTracing manual instrumentation
ja_jp: OpenTracing の手動計装を使用した GreetingsResource

source: The H2 and Derby databases can normally be configured to run in "embedded mode"; however the Derby extension does not support compiling the embedded database engine into native executables.
ja_jp: H2 データベースと Derby データベースは通常、「組込モード」で実行するように設定することができます。しかしながら、このエクステンションは、組込データベースエンジンのネイティブ実行可能ファイルへのコンパイルに対応していません。

source: The H2 and Derby databases can normally be configured to run in "embedded mode"; the extension does not support compiling the embedded database engine into native executables.
ja_jp: H2 データベースと Derby データベースは通常、「埋め込みモード」で実行するように設定することができます。また、この拡張は、組み込みデータベースエンジンのネイティブ実行可能ファイルへのコンパイルに対応していません。

source: The HTML page
ja_jp: HTMLページ

source: The HTTP POST or GET methods can be used to invoke on a function. The return value of the function is marshalled to JSON using the Jackson JSON library. Jackson annotations can be used. If your function has an input parameter, a POST invocation must use JSON as the input type. Jackson is also used here for unmarshalling.
ja_jp: HTTP POST または GET メソッドを使用して Function を呼び出すことができます。Function の戻り値は、Jackson JSON ライブラリを使用して JSON にマーシャルされます。Jackson アノテーションを使用することができます。Function に入力パラメーターがある場合、POST 呼び出しは入力タイプとして JSON を使用しなければなりません。ここでもJackson はアンマーシャリングに使用されます。

source: The HTTP method receives the payload and returns a `CompletionStage` completed when the message is written to Kafka
ja_jp: HTTPメソッドはメッセージがKafkaに書き込まれると、ペイロードを受け取り、 `CompletionStage` の完了を返します。

source: The HTTP method receiving the payload returns a `Uni<Void>`. The HTTP response is written when the operation completes (the entity is persisted and Kafka transaction is committed).
ja_jp: ペイロードを受信する HTTP メソッドは、 `Uni<Void>` を返します。HTTP 応答は、操作が完了すると書き込まれます (エンティティーは永続化され、Kafka トランザクションはコミットされます)。

source: The HTTP method receiving the payload returns a `Uni<Void>`. The HTTP response is written when the operation completes (the entity is persisted and written to Kafka).
ja_jp: ペイロードを受信する HTTP メソッドは `Uni<Void>` を返します。HTTP 応答は、操作が完了すると書き込まれます (エンティティーは永続化され、Kafka に書き込まれます)。

source: The HTTP port will not be opened.
ja_jp: HTTP ポートは開放されません。

source: The HTTP request authentication fails and the requester receives a challenge specific to the authentication mechanism, for example, a `401` error, a URL redirect to reauthenticate, or some other custom authentication challenge response. For some practical examples of challenge responses, see the Quarkus xref:security-customization.adoc[Security Tips and Tricks] guide.
ja_jp: HTTP リクエストの認証に失敗し、リクエストした側が認証メカニズム固有のチャレンジ（ `401` エラー、再認証のための URL リダイレクト、その他のカスタム認証チャレンジレスポンスなど）を受け取ります。 チャレンジレスポンスの実用的な例については、Quarkus xref:security-customization.adoc[Security Tips and Tricks] ガイドを参照してください。
